tap "eth-p/software"
tap "goles/battery"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Generic library support script
brew "libtool"
# YAML Parser
brew "libyaml"
# Library for command-line editing
brew "readline"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# General-purpose data compression with high compression ratio
brew "xz"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Collection of portable C++ source libraries
brew "boost"
# Library for manipulating PNG images
brew "libpng"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Control Google Chrome from the command-line
brew "chrome-cli"
# Ruby environment tool
brew "chruby"
# Cross-platform make
brew "cmake"
# Reimplementation of ctags(1)
brew "ctags", link: false
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Image manipulation library
brew "jpeg"
# TIFF library and utilities
brew "libtiff"
# Cross-platform C++ GUI toolkit (wxWidgets for macOS)
brew "wxmac"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Friendlier find
brew "ffind"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git", link: false
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# X.509 and CMS library
brew "libksba"
# Postgres C API library
brew "libpq"
# C XSLT library for GNOME
brew "libxslt"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Scalable distributed version control system
brew "mercurial"
# Highly capable, feature-rich programming language
brew "perl"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Optimizer for PNG files
brew "pngcrush"
# Object-relational database system
brew "postgresql", restart_service: true
# Cross-platform application and UI framework
brew "qt", link: false
# Cross-platform application and UI framework
brew "qt@5"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Source-code syntax highlighter
brew "source-highlight"
# Sparklines for the shell
brew "spark"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Download YouTube videos from the command-line
brew "youtube-dl"
# General-purpose lossless data-compression library
brew "zlib"
# Next-generation plugin manager for zsh
brew "zplug"
# Additional completion definitions for zsh
brew "zsh-completions"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
brew "goles/battery/battery"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
brew "thoughtbot/formulae/gitsh"
# Shell commands for environment parity for Heroku apps
brew "thoughtbot/formulae/parity"
# management suite for dotfiles
brew "thoughtbot/formulae/rcm"
# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
# Image editor focused on simplicity
cask "acorn"
# Application launcher and productivity software
cask "alfred"
# Multi-cloud backup application
cask "arq"
# Menu bar icon organizer
cask "bartender"
# Utility that prevents the system from going to sleep
cask "caffeine"
# API documentation browser and code snippet manager
cask "dash"
cask "font-hack-nerd-font"
# Desktop automation application
cask "hammerspoon"
# Time tracking application
cask "harvest"
# HTTP and GraphQL Client
cask "insomnia"
# Keyboard customizer
cask "karabiner-elements"
# Animated screen capture application
cask "licecap"
# App to manage software development and track bugs
cask "linear-linear"
# Previewer for Markdown, MultiMarkdown and other text markup languages
cask "marked"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Scheduling application focusing on organization
cask "omnifocus"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
cask "qlprettypatch"
cask "quicklook-csv"
cask "quicklook-json"
# Standalone app for debugging React Native apps
cask "react-native-debugger"
# Screen recording and video editing software
cask "screenflow"
# Application for inspecting installer packages
cask "suspicious-package"
cask "webpquicklook"
# Desktop chat client for Google Hangouts
cask "yakyak"
mas "1Password 7", id: 1333542190
mas "Boop", id: 1518425043
mas "CARROT Weather", id: 993487541
mas "Developer", id: 640199958
mas "Due", id: 524373870
mas "Edison Mail", id: 1489591003
mas "Extractor", id: 971826370
mas "Flow", id: 1423210932
mas "Flowstate", id: 1051600144
mas "Harvest", id: 506189836
mas "Home Assistant", id: 1099568401
mas "HotKey", id: 975890633
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Living Earth Desktop", id: 539362919
mas "Logic Pro", id: 634148309
mas "Magnet", id: 441258766
mas "Meeter", id: 1510445899
mas "Network Radar", id: 507659816
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Snappy", id: 512617038
mas "Speedtest", id: 1153157709
mas "Take a Break", id: 1457158844
mas "Termius", id: 1176074088
mas "Time Out", id: 402592703
mas "Toolbox for Pages - Templates", id: 571654652
mas "Trello", id: 1278508951
mas "WhatsApp", id: 1147396723
